src/DataProcessors/Scan_ПервоначальноеЗаполнениеРасстоянийМеждуАдресами/Scan_ПервоначальноеЗаполнениеРасстоянийМеждуАдресами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_ПервоначальноеЗаполнениеРасстоянийМеждуАдресами</name>
  <tabularSections>
    <name>ТаблицаРасстояний</name>
    <attributes>
      <name>АдресПолучения</name>
      <type>
        <types>CatalogRef.Scan_АдресаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>CatalogRef.Scan_АдресаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_РасстояниеМеждуАдресами/Scan_РасстояниеМеждуАдресами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_РасстояниеМеждуАдресами</name>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_МестаХранения/Scan_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МестаХранения</name>
  <comment>Места хранения (отгрузки, доставки)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Маршруты</name>
      <description>Маршруты</description>
    </items>
    <items>
      <name>МестаХраненияАдресаКлиентов</name>
      <description>Места хранения – адреса клиентов</description>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Места хранения (площадки)</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаФактический</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарубежныйКузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовНаПлощадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <comment>Место хранения больше не используется в программе, но сведения о нем сохранены. Недействительные места хранения скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияДилера</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.Scan_ТипыСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЧекЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользований</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапрещатьПеремещениеМестаХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СрокиДоставки</name>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Scan_ПервоначальноеЗаполнениеРасстоянийМеждуАдресами/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьАдресами(Команда)
	ЗаполнитьАдресамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресамиНаСервере()
	//Симметрия = Истина;	
	//Если Симметрия Тогда
	//	ДопУсловие = "(АдресаХранения.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//               |					И АдресаХранения.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//               |				ИЛИ АдресаХранения.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//               |					И АдресаХранения.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресПолучения)";
	//Иначе
	//	ДопУсловие = "АдресаХранения.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//               |					И АдресаХранения.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки";
	//КонецЕсли;
				  
	Объект.ТаблицаРасстояний.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический КАК АдресПолучения,
	               |	Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический КАК АдресДоставки
	               |ПОМЕСТИТЬ АдресаХранения
	               |ИЗ
	               |	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
	               |ГДЕ
	               |	Scan_МестаХранения.Маршрут = ИСТИНА
	               |	И Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический <> ЗНАЧЕНИЕ(Справочник.Scan_АдресаХранения.ПустаяСсылка)
	               |	И Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический <> ЗНАЧЕНИЕ(Справочник.Scan_АдресаХранения.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический,
	               |	Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	АдресаХранения.АдресПолучения,
				   |	АдресаХранения.АдресДоставки,
				   |	Scan_РасстояниеМеждуАдресами.Расстояние
				   |ИЗ
				   |	АдресаХранения КАК АдресаХранения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
				   |		ПО АдресаХранения.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	               |					И АдресаХранения.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки";
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекМаршрут Из ТабРезультат Цикл
		НовыйМаршрут = Объект.ТаблицаРасстояний.Добавить();
		НовыйМаршрут.АдресПолучения = ТекМаршрут.АдресПолучения;
		НовыйМаршрут.АдресДоставки = ТекМаршрут.АдресДоставки;
		НовыйМаршрут.Расстояние = ТекМаршрут.Расстояние;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	н=0;
	Для каждого ТекМаршрут из Объект.ТаблицаРасстояний.Выгрузить() Цикл
		Если ТекМаршрут.Расстояние > 0 Тогда
			МенеджерЗаписи = РегистрыСведений.Scan_РасстояниеМеждуАдресами.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.АдресПолучения 	= ТекМаршрут.АдресПолучения;
			МенеджерЗаписи.АдресДоставки 	= ТекМаршрут.АдресДоставки;
			МенеджерЗаписи.Расстояние 		= ТекМаршрут.Расстояние;
			МенеджерЗаписи.Пользователь 	= ПользователиКлиентСервер.ТекущийПользователь();
			МенеджерЗаписи.Записать();
			//нужно?
			//Сообщить("Установлено расстояние "+Строка(ТекМаршрут.Расстояние)+" км между "+ТекМаршрут.АдресПолучения+" и "+ТекМаршрут.АдресДоставки+".");
			н = н + 1;
		КонецЕсли;
	КонецЦикла;
	//rarus FominskiyAS 24.04.2019  mantis 14191 +++
	//Сообщить("Установлено "+н+" расстояний между адресами");
	Сообщить(НСтр("ru = 'Установлено '; en = 'It is set to '")+н+НСтр("ru = ' расстояний между адресами'; en = ' the distance between addresses'"));
	//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	Если н>0 Тогда
		//rarus tenkam 10.08.2017 mantis 10589 +++
		//Сообщить("Были внесены изменения Расстояний. Необходимо произвести перерасчет Тарифов доставки для дилеров",СтатусСообщения.ОченьВажное);
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Запущен фоновый пересчет тарифов.");
		Сообщить(НСтр("ru = 'Запущен фоновый пересчет тарифов.'; en = 'Tariff recalculation'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---  
		ПараметрыФоновогоЗадания = Новый Массив;
		ПараметрыФоновогоЗадания.Добавить("Изменение расстояния между адресами");
		ФоновыеЗадания.Выполнить("Scan_Тарифы.ПолныйПересчет", ПараметрыФоновогоЗадания, Новый УникальныйИдентификатор,	"Полный пересчет");
		//rarus tenkam 10.08.2017 mantis 10589 ---  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасстоянийРасстояниеПриИзменении(Элемент)
  	Расстояние1 = Элементы.ТаблицаРасстояний.ТекущиеДанные.Расстояние; 
	Адрес1 = Элементы.ТаблицаРасстояний.ТекущиеДанные.АдресПолучения;
	Адрес2 = Элементы.ТаблицаРасстояний.ТекущиеДанные.АдресДоставки;
	Для Каждого Строка из Объект.ТаблицаРасстояний Цикл
		Если Строка.АдресПолучения = Адрес2 И Строка.АдресДоставки = Адрес1 Тогда
			Строка.Расстояние = Расстояние1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры
